# Создать глобальную переменную.
my_value = 10

# Функция show_value печатает
# значение глобальной переменной.
def show_value():
    print(my_value)

# Вызвать функцию show_value.
show_value()