import sys

# Получаем слово из первого аргумента командной строки.
word = sys.argv[1]

# Напишите ваш код тут

a = word[0]
z = word[-1]

print(a, z)