# Упражнение по программированию 2.5

# Пройденное расстояние

# Переменные, содержащие расстояния.
distance6Hours = 0.0
distance10Hours = 0.0
distance15Hours = 0.0

# Константа для скорости.
SPEED = 70

# Вычислить расстояние, которое автомобиль пройдет за
# 6, 10 и 15 часов.
distance6Hours = SPEED * 6
distance10Hours = SPEED * 10
distance15Hours = SPEED * 15 

# Напечатать результаты.
print ("Автомобиль пройдет следующие расстояния:")
print (distance6Hours,"километров за 6 часов.")
print (distance10Hours,"километров за 10 часов.")
print (distance15Hours,"километров за 15 часов.")