# Эта программа сравнивает два строковых значения.
# Получить от пользователя пароль.
password = input('Введите пароль: ')

# Определить, был ли введен правильный
# пароль.
if password == 'prospero':
    print('Пароль принят.')
else:
    print('Извините, этот пароль неверный.')