
restaurants = { 'веганский реторан': ['веган', 'нонглютен', 'хлеб'],
                'кафе пчолка': ['мед', 'сахар', 'цветочки'],
                'добрый хомяк': ['сахар', 'шкварки', 'борщь'],
                'ресторан травка': ['нонглютен', 'макароны', 'борщь'],
                'маслобойня': ['молоко', 'кортоха', 'хлеб', 'борщь'],
                'жареная свинка': ['шкварки', 'макароны', 'борщь'],

               }


best_fo_you = []

search_list = ['шкварки']

for test in restaurants:
    for i in search_list:
        if i in restaurants[test]:
            best_fo_you.append(test)


print()
print(best_fo_you)
