# Эта программа демонстрирует конкатенацию строковых литералов.
first_name = input('Введите ваше имя: ')
last_name = input('Введите вашу фамилию: ')
 
# Объединить имена с пробелом между ними.
full_name = first_name + ' ' + last_name
 
# Вывести на экран полное имя пользователя.
print('Ваше полное имя: ' + full_name)