# Создать две переменные: top_speed и distance.
top_speed = 160
distance = 300

# Показать значения, на которые ссылаются переменные.
print('Предельная скорость составляет')
print(top_speed)
print('Пройденное расстояние составляет')
print(distance)  